PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f86j11.inc
;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'0FFF'
       __BADRAM  H'0F40'-H'0F59'
       __BADRAM  H'0FD4'

;==========================================================================
;
;   IMPORTANT: For the PIC18 devices, the __CONFIG directive has been
;              superseded by the CONFIG directive.  The following settings
;              are available for this device.
;
;   Watchdog Timer Enable bit:
;     WDTEN = OFF          WDT disabled (control is placed on SWDTEN bit)
;     WDTEN = ON           WDT enabled
;
;   Stack Overflow/Underflow Reset Enable bit:
;     STVREN = OFF         Reset on stack overflow/underflow disabled
;     STVREN = ON          Reset on stack overflow/underflow enabled
;
;   Extended Instruction Set Enable bit:
;     XINST = OFF          Instruction set extension and Indexed Addressing mode disabled (Legacy mode)
;     XINST = ON           Instruction set extension and Indexed Addressing mode enabled
;
;   Background Debugger Enable bit:
;     DEBUG = ON           Background debugger enabled; RB6 and RB7 are dedicated to In-Circuit Debug
;     DEBUG = OFF          Background debugger disabled; RB6 and RB7 configured as general purpose I/O pins
;
;   Code Protection bit:
;     CP0 = ON             Program memory is code-protected
;     CP0 = OFF            Program memory is not code-protected
;
;   Oscillator Selection bits:
;     FOSC = INTOSC        Internal oscillator, port function on RA6 and RA7 
;     FOSC = INTOSCO       Internal oscillator, CLKOUT on RA6 and port function on RA7
;     FOSC = INTOSCPLL     INTOSC with PLL enabled, port function on RA6 and RA7
;     FOSC = INTOSCPLLO    INTOSC with PLL enabled, CLKOUT on RA6 and port function on RA7
;     FOSC = HS            HS oscillator
;     FOSC = HSPLL         HS oscillator, PLL enabled
;     FOSC = EC            EC Oscillator, CLKO  on RA6
;     FOSC = ECPLL         EC Oscillator, PLL enabled, CLKO on RA6
;
;   Fail-Safe Clock Monitor Enable bit:
;     FCMEN = OFF          Fail-Safe Clock Monitor disabled
;     FCMEN = ON           Fail-Safe Clock Monitor enabled
;
;   Two-Speed Start-up (Internal/External Oscillator Switchover) Control bit:
;     IESO = OFF           Two-Speed Start-up disabled
;     IESO = ON            Two-Speed Start-up enabled
;
;   Watchdog Timer Postscaler Select bits:
;     WDTPS = 1            1:1
;     WDTPS = 2            1:2
;     WDTPS = 4            1:4
;     WDTPS = 8            1:8
;     WDTPS = 16           1:16
;     WDTPS = 32           1:32
;     WDTPS = 64           1:64
;     WDTPS = 128          1:128
;     WDTPS = 256          1:256
;     WDTPS = 512          1:512
;     WDTPS = 1024         1:1024
;     WDTPS = 2048         1:2048
;     WDTPS = 4096         1:4096
;     WDTPS = 8192         1:8192
;     WDTPS = 16384        1:16384
;     WDTPS = 32768        1:32768
;
;   External Address Bus Shift Enable bit:
;     EASHFT = OFF         Address shifting disabled, address on external bus reflects the PC value
;     EASHFT = ON          Address shifting enabled, address on external bus is offset to start at 000000h
;
;   External Memory Bus Configuration bits:
;     MODE = XM20          Extended Microcontroller mode - 20-bit Address mode
;     MODE = XM16          Extended Microcontroller mode - 16-bit Address mode
;     MODE = XM12          Extended Microcontroller mode - 12-bit Address mode
;     MODE = MM            Microcontroller mode - External bus disabled
;
;   Data Bus Width Select bit:
;     BW = 8               8-bit external bus mode
;     BW = 16              16-bit external bus mode
;
;   External Bus Wait Enable bit:
;     WAIT = ON            Wait states on the external bus are enabled and selected by MEMCON<5:4>
;     WAIT = OFF           Wait states on the external bus are disabled
;
;   ECCP2 MUX bit:
;     CCP2MX = ALTERNATE   ECCP2/P2A is multiplexed with RE7 in Microcontroller mode or with RB3 in Extended Microcontroller mode
;     CCP2MX = DEFAULT     ECCP2/P2A is multiplexed with RC1
;
;   ECCPx MUX bit:
;     ECCPMX = ALTERNATE   ECCP1 outputs (P1B/P1C) are multiplexed with RH7 and RH6; ECCP3 outputs (P3B/P3C) are multiplexed with RH5 and RH4
;     ECCPMX = DEFAULT     ECCP1 outputs (P1B/P1C) are multiplexed with RE6 and RE5; ECCP3 outputs (P3B/P3C) are multiplexed with RE4 and RE3
;
;   PMP Pin Multiplex bit:
;     PMPMX = ALTERNATE    PMP port pins not connected to EMB (PORTA, PORTF and PORTH)
;     PMPMX = DEFAULT      PMP port pins connected to EMB (PORTD and PORTE)
;
;   MSSP Address Masking Mode Select bit:
;     MSSPMSK = MSK5       5-Bit Address Masking mode enable
;     MSSPMSK = MSK7       7-Bit Address Masking mode enable
;
;==========================================================================
;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'


        LIST
